<?php

declare(strict_types=1);

/**
 * アーカイブとユーザー情報を紐付けするためのIIMS活動歴マスタ
 */
return [
    'gunma' => [
        'gunma_2011_sum' => '多文化交流inぐんま2011夏',
        'gunma_2012_sum' => '多文化交流inぐんま2012夏',
        'gunma_2013_sum' => '多文化交流inぐんま2013夏',
        'gunma_2014_win' => '多文化交流inぐんま2014冬',
        'gunma_2014_sum' => '多文化交流inぐんま2014夏',
        'gunma_2015_win' => '多文化交流inぐんま2015冬',
        'gunma_2015_sum' => '多文化交流inぐんま2015夏',
        'gunma_2016_win' => '多文化交流inぐんま2016冬',
        'gunma_2016_sum' => '多文化交流inぐんま2016夏',
        'gunma_2017_win' => '多文化交流inぐんま2017冬',
        'gunma_2017_sum' => '多文化交流inぐんま2017夏',
        'gunma_2018_win' => '多文化交流inぐんま2018冬',
        'gunma_2018_sum' => '多文化交流inぐんま2018夏',
        'gunma_2019_win' => '多文化交流inぐんま2019冬',
        'gunma_2019_sum' => '多文化交流inぐんま2019夏',
        'gunma_2020_sum' => '多文化交流inぐんま2020夏(オンライン)',
        'gunma_2022_sum' => '多文化交流inぐんま2022夏',
        'gunma_2023_win' => '多文化交流inぐんま2023冬',
        'gunma_2023_sum' => '多文化交流inぐんま2023夏',
        'gunma_2024_win' => '多文化交流inぐんま2024冬',
    ],
    'shizuoka' => [
        'shizuoka_2013'     => '多文化交流inしずおか2013',
        'shizuoka_2015_win' => '多文化交流inしずおか2015冬',
        'shizuoka_2015_sum' => '多文化交流inしずおか2015夏',
    ],
    'busan' => [
        'busan_2010_win' => '多文化交流in釜山2007',
        'busan_2010_sum' => '多文化交流in釜山2008',
        'busan_2011'     => '多文化交流in釜山2009',
        'busan_2012'     => '多文化交流in釜山2011',
        'busan_2013'     => '多文化交流in釜山2013',
        'busan_2014'     => '多文化交流in釜山2014',
        'busan_2015_win' => '多文化交流in釜山2015',
        'busan_2015_sum' => '多文化交流in釜山2015',
        'busan_2016'     => '多文化交流in釜山2016',
        'busan_2017'     => '多文化交流in釜山2017',
        'busan_2018'     => '多文化交流in釜山2018',
        'busan_2019'     => '多文化交流in釜山2019',
        'busan_2023'     => '多文化交流in釜山2023',
    ],
    'malang' => [
        'malang_2007' => '多文化交流inマラン2007',
        'malang_2008' => '多文化交流inマラン2008',
        'malang_2009' => '多文化交流inマラン2009',
        'malang_2011' => '多文化交流inマラン2011',
        'malang_2012' => '多文化交流inマラン2012',
        'malang_2013' => '多文化交流inマラン2013',
        'malang_2014' => '多文化交流inマラン2014',
        'malang_2015' => '多文化交流inマラン2015',
        'malang_2016' => '多文化交流inマラン2016',
        'malang_2017' => '多文化交流inマラン2017',
        'malang_2018' => '多文化交流inマラン2018',
        'malang_2019' => '多文化交流inマラン2019',
        'malang_2024' => '多文化交流inマラン2024',
    ],
    'usa' => [
        'usa_2014' => '多文化交流inUSA2014',
    ],
    'taiwan' => [
        'taiwan_2007' => '多文化交流in台湾2007 ',
        'taiwan_2008' => '多文化交流in台湾2008',
    ],
    'oyako_gunma' => [
        'oyako_gunma_2018' => '親子多文化交流in安中2018',
        'oyako_gunma_2019' => '親子多文化交流in安中2019',
    ],
    'oyako_malang' => [
        'oyako_malang_2018' => '親子多文化交流inマラン2018',
        'oyako_malang_2019' => '親子多文化交流inマラン2019',
    ],
    'online' => [
        'online_2021' => '多文化交流オンライン2021 ぐんま×マラン×プサン',
        'online_2022' => '多文化交流オンライン2022 ぐんま×マラン×プサン',
    ],
    'adult' => [
        'adult_2018' => '大人のための多文化交流',
    ],
    'gunmacup' => [
        'gunmacup_first'  => '第1回ぐんまカップ',
        'gunmacup_second' => '第2回ぐんまカップ',
    ]
];
