<?php

declare(strict_types=1);

/**
 * アーカイブとユーザー情報を紐付けするための多文化交流マスタ
 */
return [
    'ぐんま' => [
        2011 => [
            '夏' => '多文化交流inぐんま2011夏',
        ],
        2012 => [
            '夏' => '多文化交流inぐんま2012夏',
        ],
        2013 => [
            '夏' => '多文化交流inぐんま2013夏',
        ],
        2014 => [
            '冬' => '多文化交流inぐんま2014冬',
            '夏' => '多文化交流inぐんま2014夏',
        ],
        2015 => [
            '冬' => '多文化交流inぐんま2015冬',
            '夏' => '多文化交流inぐんま2015夏',
        ],
        2016 => [
            '冬' => '多文化交流inぐんま2016冬',
            '夏' => '多文化交流inぐんま2016夏',
        ],
        2017 => [
            '冬' => '多文化交流inぐんま2017冬',
            '夏' => '多文化交流inぐんま2017夏',
        ],
        2018 => [
            '冬' => '多文化交流inぐんま2018冬',
            '夏' => '多文化交流inぐんま2018夏',
        ],
        2019 => [
            '冬' => '多文化交流inぐんま2019冬',
            '夏' => '多文化交流inぐんま2019夏',
        ],
        2020 => [
            '冬' => '多文化交流inぐんま2020冬',
            '夏' => '多文化交流inぐんま2020夏',
        ],
        2021 => [
            '冬' => '多文化交流inぐんま2021冬',
            '夏' => '多文化交流inぐんま2021夏',
        ],
        2022 => [
            '冬' => '多文化交流inぐんま2022冬',
            '夏' => '多文化交流inぐんま2022夏',
        ],
        2023 => [
            '冬' => '多文化交流inぐんま2023冬',
            '夏' => '多文化交流inぐんま2023夏',
        ],
        2024 => [
            '冬' => '多文化交流inぐんま2024冬',
            '夏' => '多文化交流inぐんま2024夏',
        ],
    ],
    'しずおか' => [],
    '釜山' => [],
    'マラン' => [],
    'ポートランド' => [
        2014 => '多文化交流inU.S.A',
    ],
];
